Revit 2026 API

# IFCPropertyMappingInfoRevitPropertyId Property

---

The Revit property id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId RevitPropertyId { get; set; }
```
```vb
Public Property RevitPropertyId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ RevitPropertyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member RevitPropertyId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCPropertyMappingInfo Class

Autodesk.Revit.DB Namespace